UI-ScenarioTestManager/src/ExternalDataProcessors/МенеджерСценарногоТеста/МенеджерСценарногоТеста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExternalDataProcessor>
  <name>МенеджерСценарногоТеста</name>
  <comment>автор ivanov660 (Владимир Крючков)</comment>
  <attributes>
    <name>Severity</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвтозагрузкаДереваПроектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтозагрузкаПоследнегоСценария</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресИнтернет</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполненияUTC</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГенерироватьКодПодключенияКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГенерироватьПолучениеРодительскихОбъектовВИерархии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеОпцииЗапуска</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторТеста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПроизводитьОтключениеЕслиДальшеПодключаетсяТудаЖе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПорта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПроверки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль1С</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоискОбъектов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь1С</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьККаталогуБиблиотекиСценариев</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьККаталогуОтчетовВыполненияТестов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьККаталогуНаборовСценариев</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКИсполняемомуФайлу1С</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлуСценария</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьПодключенияКлиентаТестирования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимАвтотест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимРедактированияСценария</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СообщенияОбОшибкахПреобразования</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипФайлаСценария</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайловаяБаза</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматФайлаОтчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяЛога</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКИсполняемомуФайлуGIT</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьККаталогуGIT</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСохранениеДерева</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуемыйAPI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлуExternAutomationUI</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПортаExternAutomationUI</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресИнтернетExternAutomationUI</name>
    <comment>По умолчанию localhost</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Браузер</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключатьКомандуFocus</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимScreenShot</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоНеПредприятие1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DataDrivenTest</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлуДанных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>TestID</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключатьПоискФорм</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Исключать_xPath</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспериментальныйФункционал</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьИсполняемыйФайлБраузера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:ExternalDataProcessor>

UI-ScenarioTestManager/src/ExternalDataProcessors/МенеджерСценарногоТеста/Forms/Модуль_ОбработкаДействийAutomationUI/Module.bsl
&НаКлиенте
Перем Модуль_СервисныеФункции;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Отказ = Истина; // форма не предназначена для открытия
КонецПроцедуры

#Область Команды

&НаКлиенте
Процедура мСценСкрипт_GenerateClientConnection(ТестовоеПриложение, ОписаниеОшибки, мПараметры) Экспорт
	
	СвойстваПодключенияКлиентаТестирования = мПараметры.СвойстваПодключенияКлиентаТестирования;
	ПараметрыСценария = мПараметры.ПараметрыСценария;
	НомерПорта = мПараметры.НомерПорта;
	Интервал = мПараметры.Интервал; 
	ТекущийНомерПорта = мПараметры.ТекущийНомерПорта; 
	НомерПортаExternAutomationUI = мПараметры.НомерПортаExternAutomationUI;
	
	
	Если Найти(СвойстваПодключенияКлиентаТестирования,"&") Тогда
		ИмяПараметра = СокрЛП(СтрЗаменить(СвойстваПодключенияКлиентаТестирования,"&",""));
		СвойстваПодключенияКлиентаТестирования = мСцен_ПолучитьЗначениеПараметра(ИмяПараметра,ПараметрыСценария);
	КонецЕсли;	
	
	Попытка
		ОписаниеПодключения = мЗначениеИзСтрокиВнутр(СвойстваПодключенияКлиентаТестирования);
		Если ТипЗнч(ОписаниеПодключения)=Тип("Соответствие") Тогда
			Если ОписаниеПодключения.Получить("НомерПорта")<>Неопределено Тогда
				ТекущийНомерПорта = Число(ОписаниеПодключения.Получить("НомерПорта"));
			КонецЕсли;
		КонецЕсли;
	Исключение
		ТекущийНомерПорта = НомерПорта;
	КонецПопытки;

	
	ЗагрузитьБиблиотеки();

	// проверим связь, активна ли сессия?
	Если ЗначениеЗаполнено(ТестовоеПриложение) Тогда

		СтрокаКоманды = "&Operation=status_session&answer_format=json";
		СтруктураОтвета = Неопределено;

		СтруктураОтвета = Модуль_СервисныеФункции.ЗагрузитьФайлПоИнтернетАдресу("http://localhost:"+Формат(НомерПортаExternAutomationUI,"ЧГ=")+"/rest.html?"
			+ СтрокаКоманды);

		Если СтруктураОтвета.КодСостояния = 200 Тогда

			ТекстовыйДокумент = новый ТекстовыйДокумент();
			ТекстовыйДокумент.Прочитать(СтруктураОтвета.ПутьКФайлу, "UTF-8");
			Текст = ТекстовыйДокумент.ПолучитьТекст();
			
			РезультатПреобразования = Модуль_СервисныеФункции.ОбработкаJSON(Текст);
			
			Если РезультатПреобразования.status = "false" тогда
				ТестовоеПриложение = Неопределено;
			Иначе
				Возврат;
			КонецЕсли;
		Иначе 
			ОписаниеОшибки = "Не удалось получить данные" ;
			ТестовоеПриложение = Неопределено;
		КонецЕсли;		
		
	КонецЕсли;
	
	Если ТестовоеПриложение=Неопределено или ТестовоеПриложение="" Тогда

			// подключимся к тестируемому приложению
		// и получим хеш
		СтрокаКоманды = "&Operation=new_session&answer_format=json";
		СтруктураОтвета = Неопределено;

		СтруктураОтвета = Модуль_СервисныеФункции.ЗагрузитьФайлПоИнтернетАдресу("http://localhost:"+Формат(НомерПортаExternAutomationUI,"ЧГ=")+"/rest.html?"
			+ СтрокаКоманды);

		Если НЕ СтруктураОтвета.КодСостояния = 200 Тогда
			ОписаниеОшибки = "Не удалось получить данные";
		КонецЕсли;

		ТекстовыйДокумент = новый ТекстовыйДокумент();
		ТекстовыйДокумент.Прочитать(СтруктураОтвета.ПутьКФайлу, "UTF-8");
		Текст = ТекстовыйДокумент.ПолучитьТекст();

		РезультатПреобразования = Модуль_СервисныеФункции.ОбработкаJSON(Текст);
		
		ТестовоеПриложение = РезультатПреобразования.session_id;
		
	КонецЕсли;
	
	мПараметры.ТекущийНомерПорта = ТекущийНомерПорта;
		
КонецПроцедуры

&НаКлиенте
Функция мСцен_ПолучитьЗначениеПараметра(Знач ИмяПараметра,ПараметрыСценария) Экспорт
	
	Для каждого стр из ПараметрыСценария Цикл
		Если ВРег(стр.Имя)=Врег(ИмяПараметра) Тогда
			Возврат стр.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервереБезКонтекста
Функция мЗначениеИзСтрокиВнутр(Значение) Экспорт
	Возврат ЗначениеИзСтрокиВнутр(Значение);
КонецФункции


&НаКлиенте
Процедура мСценСкрипт_GenerateClientDisconnection(ТестовоеПриложение, ОписаниеОшибки, мПараметры) Экспорт	

	НомерПортаExternAutomationUI = мПараметры.НомерПортаExternAutomationUI;

	// подключимся к тестируемому приложению
	СтрокаКоманды = "&Operation=delete_step&answer_format=json&session_id="+ТестовоеПриложение; 
	СтруктураОтвета = Неопределено;

	СтруктураОтвета = Модуль_СервисныеФункции.ЗагрузитьФайлПоИнтернетАдресу("http://localhost:"+Формат(НомерПортаExternAutomationUI,"ЧГ=")+"/rest.html?"+СтрокаКоманды);

	Если НЕ СтруктураОтвета.КодСостояния=200 Тогда
		ОписаниеОшибки =  "Не удалось получить данные";
	КонецЕсли;
	
	ТекстовыйДокумент = новый ТекстовыйДокумент();
	ТекстовыйДокумент.Прочитать(СтруктураОтвета.ПутьКФайлу,"UTF-8");
	Текст = ТекстовыйДокумент.ПолучитьТекст();
	
	//РезультатПреобразования = Модуль_СервисныеФункции.ОбработкаJSON(Текст);
	
	//ТестовоеПриложение = Текст; // guid сессии	

	
КонецПроцедуры

&НаКлиенте
Процедура мСценСкрипт_НайтиОсновноеОкно(ТестовоеПриложение,ОписаниеОшибки,ТекущаяПеременная, мПараметры) Экспорт
	
	ЗаголовокОбъекта = мПараметры.ЗаголовокОбъекта;
	PID = мПараметры.PID;
	ИспользоватьВариантыПоиска = мПараметры.ИспользоватьВариантыПоиска;
	НомерПортаExternAutomationUI = мПараметры.НомерПортаExternAutomationUI;
	
	// подключимся к тестируемому приложению
	СтрокаКоманды = "&Operation=play_step&answer_format=json&session_id="+ТестовоеПриложение;
	СтрокаКоманды = СтрокаКоманды + "&api=Automation UI";
	СтрокаКоманды = СтрокаКоманды + "&action=find main window";
	СтрокаКоманды = СтрокаКоманды + "&process_id="+PID;
	СтрокаКоманды = СтрокаКоманды + "&element_name="+ЗаголовокОбъекта;
	
	 
	СтруктураОтвета = Неопределено;

	СтруктураОтвета = Модуль_СервисныеФункции.ЗагрузитьФайлПоИнтернетАдресу("http://localhost:"+Формат(НомерПортаExternAutomationUI,"ЧГ=")+"/rest.html?"+СтрокаКоманды);

	Если НЕ СтруктураОтвета.КодСостояния=200 Тогда
		ОписаниеОшибки =  "Не удалось получить данные";
	КонецЕсли;
	
	ТекстовыйДокумент = новый ТекстовыйДокумент();
	ТекстовыйДокумент.Прочитать(СтруктураОтвета.ПутьКФайлу,"UTF-8");
	Текст = ТекстовыйДокумент.ПолучитьТекст();
	
	РезультатПреобразования = Модуль_СервисныеФункции.ОбработкаJSON(Текст);
	
	Если НРег(РезультатПреобразования.error)="true" Тогда
		ОписаниеОшибки = РезультатПреобразования.message;
		ВызватьИсключение ОписаниеОшибки;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура мСценСкрипт_НайтиОкно(ТестовоеПриложение,ОписаниеОшибки,ТекущаяПеременная,мПараметры) Экспорт

	ЗаголовокОбъекта = мПараметры.ЗаголовокОбъекта;
	PID = мПараметры.PID;
	ИспользоватьВариантыПоиска = мПараметры.ИспользоватьВариантыПоиска;
	НомерПортаExternAutomationUI = мПараметры.НомерПортаExternAutomationUI;

	// подключимся к тестируемому приложению
	СтрокаКоманды = "&Operation=play_step&answer_format=json&session_id="+ТестовоеПриложение;
	СтрокаКоманды = СтрокаКоманды + "&api=Automation UI";
	СтрокаКоманды = СтрокаКоманды + "&action=find window";
	СтрокаКоманды = СтрокаКоманды + "&process_id="+PID;
	СтрокаКоманды = СтрокаКоманды + "&element_name="+ЗаголовокОбъекта;
	
	 
	СтруктураОтвета = Неопределено;

	СтруктураОтвета = Модуль_СервисныеФункции.ЗагрузитьФайлПоИнтернетАдресу("http://localhost:"+Формат(НомерПортаExternAutomationUI,"ЧГ=")+"/rest.html?"+СтрокаКоманды);

	Если НЕ СтруктураОтвета.КодСостояния=200 Тогда
		ОписаниеОшибки =  "Не удалось получить данные";
	КонецЕсли;
	
	ТекстовыйДокумент = новый ТекстовыйДокумент();
	ТекстовыйДокумент.Прочитать(СтруктураОтвета.ПутьКФайлу,"UTF-8");
	Текст = ТекстовыйДокумент.ПолучитьТекст();
	
	РезультатПреобразования = Модуль_СервисныеФункции.ОбработкаJSON(Текст);
	
	Если НРег(РезультатПреобразования.error)="true" Тогда
		ОписаниеОшибки = РезультатПреобразования.message;
		ВызватьИсключение ОписаниеОшибки;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура мСценСкрипт_НайтиОбъект(ТестовоеПриложение,ОписаниеОшибки,ТекущаяПеременная, мПараметры) Экспорт
	
	ТипОбъекта = мПараметры.ТипОбъекта;
	РодительПеременная = мПараметры.РодительПеременная;
	ЗаголовокОбъекта = мПараметры.ЗаголовокОбъекта;
	ИмяОбъекта = мПараметры.ИмяОбъекта;
	ИмяКлассаОбъекта = мПараметры.ИмяКлассаОбъекта;
	ИспользоватьВариантыПоиска = мПараметры.ИспользоватьВариантыПоиска;
	НомерПортаExternAutomationUI = мПараметры.НомерПортаExternAutomationUI;
	
	СтрокаКоманды = "&Operation=play_step&answer_format=json&session_id="+ТестовоеПриложение;
	СтрокаКоманды = СтрокаКоманды + "&api=Automation UI";
	СтрокаКоманды = СтрокаКоманды + "&action=find element";
	СтрокаКоманды = СтрокаКоманды + "&element_name="+ЗаголовокОбъекта;
	СтрокаКоманды = СтрокаКоманды + "&element_class_name="+ИмяКлассаОбъекта;
	СтрокаКоманды = СтрокаКоманды + "&element_type="+ТипОбъекта;	
	 
	СтруктураОтвета = Неопределено;

	СтруктураОтвета = Модуль_СервисныеФункции.ЗагрузитьФайлПоИнтернетАдресу("http://localhost:"+Формат(НомерПортаExternAutomationUI,"ЧГ=")+"/rest.html?"+СтрокаКоманды);

	Если НЕ СтруктураОтвета.КодСостояния=200 Тогда
		ОписаниеОшибки =  "Не удалось получить данные";
	КонецЕсли;
	
	ТекстовыйДокумент = новый ТекстовыйДокумент();
	ТекстовыйДокумент.Прочитать(СтруктураОтвета.ПутьКФайлу,"UTF-8");
	Текст = ТекстовыйДокумент.ПолучитьТекст();
	
	РезультатПреобразования = Модуль_СервисныеФункции.ОбработкаJSON(Текст);
	
	Если НРег(РезультатПреобразования.error)="true" Тогда
		ОписаниеОшибки = РезультатПреобразования.message;
		ВызватьИсключение ОписаниеОшибки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура мСценСкрипт_ВыполнитьКоманду(ТестовоеПриложение,ОписаниеОшибки,ТекущаяПеременная,мПараметры) Экспорт
	
	ИмяКоманды = мПараметры.ИмяКоманды;
	ТипОбъекта = мПараметры.ТипОбъекта;
	РодительПеременная = мПараметры.РодительПеременная;
	ЗаголовокОбъекта = мПараметры.ЗаголовокОбъекта;
	OutputText = мПараметры.OutputText;
	CommandRef = мПараметры.CommandRef;
	Presentation = мПараметры.Presentation;
	Direction = мПараметры.Direction;
	RowDescription = мПараметры.RowDescription;
	SwitchSelection = мПараметры.SwitchSelection;
	Cancel = мПараметры.Cancel;
	Area = мПараметры.Area;
	ИмяПараметра = мПараметры.ИмяПараметра;
	ЗначениеПараметра = мПараметры.ЗначениеПараметра;
	ПараметрыСценария = мПараметры.ПараметрыСценария;
	НомерПортаExternAutomationUI = мПараметры.НомерПортаExternAutomationUI;
	ClickX = мПараметры.ClickX;
	ClickY = мПараметры.ClickY;
	
	СтрокаКоманды = "&Operation=play_step&answer_format=json&session_id="+ТестовоеПриложение;
	СтрокаКоманды = СтрокаКоманды + "&api=Automation UI";
	СтрокаКоманды = СтрокаКоманды + "&action=command";
	СтрокаКоманды = СтрокаКоманды + "&ClickX="+ClickX;
	СтрокаКоманды = СтрокаКоманды + "&ClickY="+ClickY;
	 
	СтруктураОтвета = Неопределено;

	СтруктураОтвета = Модуль_СервисныеФункции.ЗагрузитьФайлПоИнтернетАдресу("http://localhost:"+Формат(НомерПортаExternAutomationUI,"ЧГ=")+"/rest.html?"+СтрокаКоманды);

	Если НЕ СтруктураОтвета.КодСостояния=200 Тогда
		ОписаниеОшибки =  "Не удалось получить данные";
	КонецЕсли;
	
	ТекстовыйДокумент = новый ТекстовыйДокумент();
	ТекстовыйДокумент.Прочитать(СтруктураОтвета.ПутьКФайлу,"UTF-8");
	Текст = ТекстовыйДокумент.ПолучитьТекст();
	
	РезультатПреобразования = Модуль_СервисныеФункции.ОбработкаJSON(Текст);
	
	Если НРег(РезультатПреобразования.error)="true" Тогда
		ОписаниеОшибки = РезультатПреобразования.message;
		ВызватьИсключение ОписаниеОшибки;
	КонецЕсли;
	

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ЗагрузитьБиблиотеки()
	
	Если Модуль_СервисныеФункции=Неопределено Тогда
		Модуль_СервисныеФункции = ПолучитьФорму("ВнешняяОбработка.МенеджерСценарногоТеста.Форма.Модуль_СервисныеФункции");
	КонецЕсли;		
	
КонецПроцедуры
